load.test.yml
config:
  target: "http://localhost:3003"
  processor: "./loadTestData.js"
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 60
      arrivalRate: 5
      rampTo: 20
    - duration: 240
      arrivalRate: 20
    - duration: 120
      arrivalRate: 20
      rampTo: 5
scenarios:
  - name: "Get records"
    flow:
      - loop:
          - function: "generateWeightedId"
          - get:
              url: "/products/{{ id }}"
        count: 100