load.test.yml
config:
  target: "http://0.0.0.0:3003"
  processor: "./loadTestData.js"
  http:
    pool: 3
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 1000
    - duration: 240
      arrivalRate: 1000
    - duration: 30
      arrivalRate: 1000
      rampTo: 5
scenarios:
  - name: "Get products"
    flow:
      - function: "generateWeightedId"
      - get:
          url: "/products/{{ id }}"
      # - function: "generateWeightedName"
      # - get:
      #     url: "/products/name/{{ name }}"
      # - function: "generateProductInfo"
      # - patch:
      #     url: "/products/{{ id }}"
      #     json:
      #       brand: "{{ brand }}"
      #       is_prime: "{{ is_prime }}"
      #       num_questions: "{{ num_questions }}"
      #       product_name: "{{ product_name }}"
      #       product_price: "{{ product_price }}"
      #       product_tier: "{{ product_tier }}"
      #       review_totals: "{{ review_totals }}"
      #       seller_name: "{{ seller_name }}"
      #       stock_count: "{{ stock_count }}"
      #       thumbnail_url: "{{ thumbnail_url }}"
      # - post:
      #     url: "/products"
      #     json:
      #       brand: "{{ brand }}"
      #       is_prime: "{{ is_prime }}"
      #       num_questions: "{{ num_questions }}"
      #       product_name: "{{ product_name }}"
      #       product_price: "{{ product_price }}"
      #       product_tier: "{{ product_tier }}"
      #       review_totals: "{{ review_totals }}"
      #       seller_name: "{{ seller_name }}"
      #       stock_count: "{{ stock_count }}"
      #       thumbnail_url: "{{ thumbnail_url }}"