load.test.yml
config:
  target: "http://localhost:3003"
  # processor: "./loadTestData.js"
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 20
      arrivalRate: 5
      rampTo: 1000
    - duration: 20
      arrivalRate: 1000
  payload:
    path: "load.test.data.csv"
    fields:
      - "id"
scenarios:
  - name: "Retrieve records"
    flow:
      # - function: getRandomId
      - get:
          url: "/{{ id }}"